tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "oven-sh/bun"
tap "remotemobprogramming/brew"
tap "sst/tap"
brew "webp"
brew "btop"
brew "cmatrix"
brew "eslint"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fnm"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "hadolint"
brew "imagemagick"
brew "jpegoptim"
brew "kondo"
brew "lazygit"
brew "python@3.13"
brew "luarocks"
brew "mpv"
brew "tree-sitter"
brew "neovim"
brew "pipenv"
brew "pipx"
brew "pngquant"
brew "podman"
brew "pre-commit"
brew "python@3.12"
brew "ripgrep"
brew "ruby"
brew "simple-scan"
brew "stow"
brew "tree"
brew "trufflehog"
brew "wget"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "jesseduffield/lazydocker/lazydocker"
brew "oven-sh/bun/bun"
brew "remotemobprogramming/brew/mob"
brew "sst/tap/opencode"
cask "audacity"
cask "balenaetcher"
cask "bitwarden"
cask "brave-browser"
cask "cursor"
cask "figma"
cask "firefox@developer-edition"
cask "ghostty"
cask "github"
cask "hyperkey"
cask "keycastr"
cask "logseq"
cask "microsoft-auto-update"
cask "microsoft-edge@dev"
cask "microsoft-teams"
cask "monitorcontrol"
cask "obsidian"
cask "orion"
cask "podman-desktop"
cask "raycast"
cask "shottr"
cask "slack"
cask "tunnelblick"
cask "utm"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "whatsapp"
cask "zed"
vscode "aaron-bond.better-comments"
vscode "antfu.icons-carbon"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cipchk.cssrem"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "kamikillerto.vscode-colorize"
vscode "mattpocock.ts-error-translator"
vscode "ms-azuretools.vscode-docker"
vscode "orta.vscode-jest"
vscode "patbenatar.advanced-new-file"
vscode "richie5um2.vscode-sort-json"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "tobermory.es6-string-html"
vscode "unifiedjs.vscode-mdx"
vscode "wix.vscode-import-cost"
vscode "zignd.html-css-class-completion"
