# Brewfile — Flexion MBP (personal daily driver)
#
# Install with:
#   brew bundle install --file=~/dotfiles/homebrew/Brewfile

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "homebrew/services"
tap "manaflow-ai/cmux"
tap "oven-sh/bun"

# ── Brews ─────────────────────────────────────────────────────────────────────

# audio / video
brew "ffmpeg"
brew "mpv"

# containers
brew "hadolint"                # Dockerfile linter
brew "lazydocker"              # container TUI
brew "podman"

# editors & AI
brew "luarocks"                # Lua package manager (neovim plugins)
brew "neovim"
brew "opencode"                # AI coding agent
brew "tree-sitter"             # parser generator (neovim)

# files & search
brew "fd"                      # fast find
brew "fzf"                     # fuzzy finder
brew "kondo"                   # project cleaner
brew "ripgrep"                 # fast grep (rg)
brew "tree"                    # directory listing
brew "wget"

# git
brew "gh"                      # GitHub CLI
brew "lazygit"                 # git TUI
brew "mob"                     # mob programming
brew "pre-commit"              # repo-level hooks
brew "trufflehog"              # secrets scanner

# image processing
brew "ghostscript"
brew "imagemagick"
brew "jpegoptim"
brew "pngquant"
brew "webp"

# node / js
brew "eslint"
brew "fnm"                     # Node version manager
brew "oven-sh/bun/bun"

# python
brew "pipenv"
brew "pipx"
brew "python@3.12"
brew "python@3.13"

# ruby
brew "ruby"

# shell
brew "btop"                    # resource monitor
brew "cmatrix"
brew "fastfetch"               # system info
brew "simple-scan"
brew "stow"                    # dotfile management
brew "zoxide"                  # smart cd
brew "zsh-syntax-highlighting"

# ── Casks ─────────────────────────────────────────────────────────────────────

# browsers
cask "brave-browser"
cask "firefox@developer-edition"
cask "orion"

# dev tools
cask "github"                  # GitHub Desktop
cask "podman-desktop"

# editors & terminals
cask "manaflow-ai/cmux/cmux"        # terminal (reads ghostty config; no separate config needed)
cask "ghostty"
cask "visual-studio-code"
cask "visual-studio-code@insiders"
cask "zed"

# notes & knowledge
cask "logseq"
cask "obsidian"

# productivity
cask "bitwarden"
cask "figma"
cask "raycast"

# social
cask "slack"
cask "whatsapp"

# system utilities
cask "audacity"
cask "balenaetcher"
cask "hyperkey"
cask "keycastr"
cask "monitorcontrol"
cask "shottr"
cask "tunnelblick"

# ── VS Code extensions ────────────────────────────────────────────────────────

# AI
vscode "danielsanmedium.dscodegpt"
vscode "github.copilot"
vscode "github.copilot-chat"

# CSS & styling
vscode "bradlc.vscode-tailwindcss"
vscode "cipchk.cssrem"
vscode "kamikillerto.vscode-colorize"
vscode "zignd.html-css-class-completion"

# editor utilities
vscode "patbenatar.advanced-new-file"
vscode "richie5um2.vscode-sort-json"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"

# git
vscode "github.vscode-pull-request-github"

# HTML, markdown & markup
vscode "bierner.markdown-preview-github-styles"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "tobermory.es6-string-html"
vscode "unifiedjs.vscode-mdx"

# JavaScript / TypeScript
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "mattpocock.ts-error-translator"
vscode "orta.vscode-jest"
vscode "wix.vscode-import-cost"

# themes & icons
vscode "aaron-bond.better-comments"
vscode "antfu.icons-carbon"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "file-icons.file-icons"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"

# other
vscode "ms-azuretools.vscode-docker"
